Revit 2027 API
RevitLinkGraphicsSettings.SetViewDetailLevel Method
 Sets view detail level and detail level type of RevitLinkGraphicsSettings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetViewDetailLevel(
	LinkVisibility viewDetailLevelType,
	ViewDetailLevel viewDetailLevel
)
Public Sub SetViewDetailLevel (
	viewDetailLevelType As LinkVisibility,
	viewDetailLevel As ViewDetailLevel
)
public:
void SetViewDetailLevel(
	LinkVisibility viewDetailLevelType,
	ViewDetailLevel viewDetailLevel
)
member SetViewDetailLevel :
        viewDetailLevelType : LinkVisibility *
        viewDetailLevel : ViewDetailLevel -> unit
Parameters
viewDetailLevelType LinkVisibility
 The type of the view detail level.
viewDetailLevel ViewDetailLevel
 The view detail level. If viewDetailLevelType is set to ByHostView or ByLinkView the viewDetailLevel must be set to Undefined.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace